OpenFoam/system/blockMeshDict
FoamFile
{
	version	2.0;
    	format	ascii;
	class	dictionary;
	object	blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

scale	1;

vertices
(
	(-1 -1.3 -.75)	// 0
	(2 -1.3 -.75)	// 1
	(2 0 -.75)	// 2
	(-1 0 -.75)	// 3
//
	(-1 -1.3 .75)	// 4
	(2 -1.3 .75)	// 5
	(2 0 .75)	// 6
	(-1 0 .75)	// 7
);

blocks
(
	hex (0 1 2 3 4 5 6 7) 
	(10 10 10)
	simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(1 2 6 5)
		);
	}
	
	sidewalls
	{
		type patch;
		faces
		(
			(0 1 5 4)
			(0 3 2 1)
			(4 5 6 7)
			(3 7 6 2)
		);
	}
);

mergePatchPairs
(
);
