OpenFoam/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (${Vinf} 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }

    outlet
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }

    wing
    {
        type            noSlip;
    }
    
    wall
    {
 	type		noSlip;
    }

    sidewalls
    {
        type            freestreamVelocity;
	freestreamValue	$internalField;
    }

}


// ************************************************************************* //

