OpenFoam/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 101e+03;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
  
    inlet
    {
	type	freestreamPressure;
	freestreamValue $internalField;
    }

    outlet
    {
        type	freestreamPressure;
        freestreamValue	$internalField;
    }

    wing
    {
	type		zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }


    sidewalls
    {
	type	zeroGradient;
    }
    

}


// ************************************************************************* //

