OpenFoam/0.orig/nuTilda
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4e-05;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

     inlet
    {
        type            freestream;
        freestreamValue $internalField;
    }

    outlet
    {
        type            freestream;
        freestreamValue $internalField;
    }

    wing
    {
        type            fixedValue;
        value           uniform 0;
    }

    wall
    {
        type            fixedValue;
        value           uniform 0;
    }


    sidewalls
    {
	type	zeroGradient;
    }

}


// ************************************************************************* //

