OpenFoam/0.orig/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-05;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"    

    inlet
    {
        type          freestream;  
        freestreamValue $internalField;
    }

    outlet
    {
        type            freestream;
        freestreamValue $internalField;
    }

    wing
    {
	type		nutUSpaldingWallFunction;
	value		uniform 0;
    }

    wall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    sidewalls
    { 
	type calculated;
	value $internalField;
    }


}
