OpenFoam/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.01;
	smoother 	GaussSeidel;
    }

    Phi
    {
	$p;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
	nSweeps		2;
        tolerance       1e-08;
        relTol          0.1;
    }

    nuTilda
    {
	solver		smoothSolver;
	smoother	GaussSeidel;
	nSweeps		2;
	tolerane	1e-08;
	relTol		0.1;
    }

}

SIMPLE
{
	nNonOrthogonalCorrectors	0;
	consistent	yes;
	/*
	residualControl
	{
		p	1e-2;
		U	1e-3;
		nuTilda 1e-5;
	}
	*/
}


potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
	fields
	{
		p	0.3;
	}
	equations
	{
		U	0.7;
		nuTilda	0.7;
	}
}

cache
{
	grad(U);
}
